import { describe, it, expect } from 'vitest';
import { tableToJSON } from '../src/utils/mdUtil';

describe('src/utils/mdUtil.ts', () => {
  describe('tableToJSON', () => {
    it('default', () => {
      expect(tableToJSON('')).toEqual(undefined);

      expect(
        tableToJSON(
          '时间 | 地址 | 灰度/百分比\n---|---|---\n4.4 20:00 | 人传人主会场 | 灰度\n4.5 16:00 | 人传人主会场 | 1~30%\n4.6 16:00 | 人传人主会场 | 50%~100%\n4.4 20:00 | 人传人面对面分享 | 灰度\n4.5 16:00 | 人传人面对面分享 | 1~30%\n4.6 16:00 | 人传人面对面分享 | 50%~100%'
        )
      ).toEqual([
        {
          时间: '4.4 20:00',
          地址: '人传人主会场',
          '灰度/百分比': '灰度',
        },
        {
          时间: '4.5 16:00',
          地址: '人传人主会场',
          '灰度/百分比': '1~30%',
        },
        {
          时间: '4.6 16:00',
          地址: '人传人主会场',
          '灰度/百分比': '50%~100%',
        },
        {
          时间: '4.4 20:00',
          地址: '人传人面对面分享',
          '灰度/百分比': '灰度',
        },
        {
          时间: '4.5 16:00',
          地址: '人传人面对面分享',
          '灰度/百分比': '1~30%',
        },
        {
          时间: '4.6 16:00',
          地址: '人传人面对面分享',
          '灰度/百分比': '50%~100%',
        },
      ]);

      expect(
        tableToJSON(
          '|时间 | 地址 | 灰度/百分比|\n---|---|---\n4.4 20:00 | 人传人主会场 | 灰度'
        )
      ).toEqual([
        {
          时间: '4.4 20:00',
          地址: '人传人主会场',
          '灰度/百分比': '灰度',
        },
      ]);

      expect(
        tableToJSON(
          '| 日期 | 时间 | 进度 | 链接 |\n| --- | --- | --- | --- |\n| 4.4 | 20:00 | 灰度 | 人传人主会场 |\n| 4.5 | 16:00 | 1~30% | 人传人主会场 |\n| 4.6 | 16:00 | 50%~100% | 人传人主会场 |\n| 4.4 | 20:00 | 灰度 | 人传人面对面分享 |\n| 4.5 | 16:00 | 1~30% | 人传人面对面分享 |\n| 4.6 | 16:00 | 50%~100% | 人传人面对面分享 |'
        )
      ).toEqual([
        {
          日期: '4.4',
          时间: '20:00',
          进度: '灰度',
          链接: '人传人主会场',
        },
        {
          日期: '4.5',
          时间: '16:00',
          进度: '1~30%',
          链接: '人传人主会场',
        },
        {
          日期: '4.6',
          时间: '16:00',
          进度: '50%~100%',
          链接: '人传人主会场',
        },
        {
          日期: '4.4',
          时间: '20:00',
          进度: '灰度',
          链接: '人传人面对面分享',
        },
        {
          日期: '4.5',
          时间: '16:00',
          进度: '1~30%',
          链接: '人传人面对面分享',
        },
        {
          日期: '4.6',
          时间: '16:00',
          进度: '50%~100%',
          链接: '人传人面对面分享',
        },
      ]);
    });
  });
});
